app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)
---
	def create
		@post = current_user.posts.build(post_params)

		if @post.save

UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?
---
	def update
		if @post.update(post_params)